export default {
    list:[{
        name:"车驿站养护中心",
        companyName:"众享车驿站（天津）网络科技有限公司",
        startTime:"2018/06",
        endTime:"至今",
        technologyTag:["vue",'elementUI','vuex','vue-router','axios','vux','webpack','v-charts','vue-amap',"Thinkphp5.0","redis","mysql"],
        caseImage:[],
        team:7,
        projectDesc:"该项目依靠 obd 设备对汽车进行数据收集,通过搭建项目平台连接人、车、设备，让汽车数据更好的服务客户；同时也让公司更好的捕获市场趋势。整个项目包含总控后台，加盟商管理系统，门店管理系统以及小程序用户端。功能模块包含：数据可视化、权限管理、订单处理、商品采购、门店管理、用户管理、多场景抽奖等。",
        myHarvest:"该项目引入敏捷开发模式和前端工程化的开发方式，团队协作效率有明显提高，用户体验也得到了很大的提升，也专注在基础组件的开发中（不在过度的耦合业务）。同时也让我对组件化模块化以及前端工程化有了更深的认识。对技术细节也有了更深的把控！"
    },{
        name:"众享销售平台",
        companyName:"众享通赢（天津）网络科技有限公司",
        startTime:"2017/05",
        endTime:"2018/06",
        technologyTag:["bootstrap","jquery","weui","e-charts","jsBrige","TP Template","vue","vux","vue-router","axios"],
        caseImage:[],
        team:7,
        projectDesc:"该项目为一个基于LBS的商家支付电商平台，接入第三方支付为平台入驻商家提供聚合支付，然后统一为商家的用户做会员积分管理系统。会员用户可以在平台上进行统一的积分兑换商品业务（购物车、多属性商品、多商户自定义店铺等）类电商平台。同时为商家做了大量的线上营销推广、活动功能模块（多级分销、抽奖、会员跟进等）。",
        myHarvest:"通过这个项目我实践了混合开发的方式，业务多变的页面用 webpage ，不经常变动的功能页面用原生开发，为公司节省了大量的开发成本和维护成本，让技术更好的跟着业务走。通过对自己产品的打造，也去做了大量前端的性能优化（ cdn 加速，缓存策略，静态资源加载顺序等）和前端安全防护（ https 、 XSS 和 CSRF ）的实践。"
    },{
        name:"倾象智能洗衣",
        companyName:"天津天迅达科技有限公司",
        startTime:"2016/06",
        endTime:"2017/03",
        technologyTag:["bootstrap","jquery","Swiper","e-charts","weui","canvas","TP Template","Thinkphp3.2","mysql"],
        caseImage:[],
        team:7,
        projectDesc:"该项目是一款共享经济的项目，在各大校园等公共场合投放洗衣机，通过平台连接用户、洗衣机和闲散的公共空间。让用户可以通过微信扫码进行选择洗衣方式。解决了一部分人的刚性需求。平台包含软硬对接，用户优惠券和年卡等功能开发，积分奖励邀请送礼等线上活动版块开发。很好的实现了软硬结合，解放劳动力！",
        myHarvest:"全站手工 css 布局， js 脚本编写业务代码数据交互，为我打下了坚实的 css 和 js 基础。过程中遇到了很多坑，也都通过查阅资料请求社区帮助顺利解决。软硬结合的开发让我对设备和服务端通信有了一定的了解。同时也首次在前后端分离的情况下，尝试在前端进行页面渲染以及进行对应的性能优化和安全防护策略制定！"
    }
]
}